[{"id":"0.5388846233198161","title":"Nintendo GameCube (Purple)","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/81waV%2BC0%2B9L._SL1500_.jpg","description":"This is an awesome system. With a great selection of games and amazing graphics for its time, this retro gaming system is the perfect addition to your console collection. ","price":"249.99"},{"id":"0.20391120987810774","title":"Nintendo GameCube Controller (Purple)","imageUrl":"https://upload.wikimedia.org/wikipedia/commons/4/41/Gamecube-controller-breakdown.jpg","description":"Some say it still might be the most comfortable gaming controller ever made. Use this controller with your GameCube, Wii, Wii U, and Nintendo Switch.","price":"25.99"},{"id":"0.424324928862448","title":"Nintendo Super Smash Bros Melee","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51JVNG4P1DL.jpg","description":"This is one of the most iconic games to ever come out on GameCube. Super Smash Bros is a fun competitive multiplayer game that gives a perfect combination of all of your favorite Nintendo characters. ","price":"89.99"},{"id":"0.9399451277623934","title":"Nintendo Mario Kart: Double Dash","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51TRQA05HBL.jpg","description":"This is another iconic GameCube game. Mario Kart: Double Dash offered a unique way to play Mario Kart where each racer has two characters each with their own specials. This game is great fun for all ages and a must-have. ","price":"79.99"},{"id":"0.5797122284087814","title":"Nintendo The Legend of Zelda: The Wind Waker","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/51W8C95QDDL.jpg","description":"This is a great game for all of the Zelda enthusiasts out there. This game will have to captivated with its adventures, puzzles, and mini-games. ","price":"99.99"},{"id":"0.27896415181440815","title":"Resident Evil 4","imageUrl":"https://upload.wikimedia.org/wikipedia/en/d/d9/Resi4-gc-cover.jpg","description":"This survival horror is a great game for those looking to get their adrenaline pumping. With a redesigned look and play style, Resident Evil 4 takes all of the fun from the older generations and combines it with a more modern style of game play. ","price":"59.99"},{"id":"0.865237792907261","title":"Star Wars Rogue Squadron II: Rogue Leader","imageUrl":"https://upload.wikimedia.org/wikipedia/en/2/26/Rogue_squadron_2_Box.jpg","description":"Are you a Star Wars fan? If so this game is a must-have. It's full of excitement and adventure. This game was critically acclaimed for its graphics, sound, and gameplay. This is one game you don't want to miss out on.","price":"49.99"},{"id":"0.9636402561432458","title":"Nintendo GameCube Controller Extenders (4 pack)","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/71T%2BUh-qykL._SL1400_.jpg","description":"Are you tired of sitting three feet from your TV to play your favorite GameCube game? Tired of getting up to sit on the couch and pulling the entire console off the shelf? Well no more. These extenders will give you an additional 6ft of cable so that you can sit anywhere in the room. ","price":"10.99"},{"id":"0.5756462625839189","title":"Nintendo Memory Card 512MB","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/814E4LkfveL._AC_SL1200_.jpg","description":"This memory card is great for all of your saving needs. With 512MB of storage, you'll have plenty for all of your saves. This card can be used for either a GameCube or Wii console. ","price":"11.99"},{"id":"0.5161786941213711","title":"Nintendo GameCube Game Boy Player - Silver","imageUrl":"https://images-na.ssl-images-amazon.com/images/I/41AT0DQ2HGL.jpg","description":"With this unique GameCube addon, you can play all of your favorite Game Boy games right on your GameCube. This is one of the shining features of the GameCube and it an addon that any Game Boy owner would love to have. ","price":"179.99"}]